{
  "_name_or_path": "distilbert_airline",
  "activation": "gelu",
  "architectures": [
    "DistilBertForSequenceClassification"
  ],
  "attention_dropout": 0.1,
  "dim": 768,
  "dropout": 0.1,
  "dtype": "float32",
  "hidden_dim": 3072,
  "id2label": {
    "0": "Seat Upgrade Request",
    "1": "Carry On Luggage Faq",
    "2": "Prohibited Items Faq",
    "3": "Baggage Delay",
    "4": "Flight Status",
    "5": "Travel Alerts",
    "6": "Meal Preferences",
    "7": "Cancellation Policy",
    "8": "Seat Availability",
    "9": "Damaged Bag",
    "10": "Medical Policy",
    "11": "Check In Luggage Faq",
    "12": "Pet Travel",
    "13": "Sports Music Gear",
    "14": "Insurance",
    "15": "Change Flight",
    "16": "Fare Check",
    "17": "Missing Bag",
    "18": "Frequent Flyer",
    "19": "Discounts",
    "20": "Flights Info",
    "21": "Airport Transfers",
    "22": "Airport Lounge Access",
    "23": "Complaints",
    "24": "Special Assistance",
    "25": "Travel Documents",
    "26": "Cancel Trip",
    "27": "Refund / Compensation"
  },
  "initializer_range": 0.02,
  "label2id": {
    "Airport Lounge Access": 22,
    "Airport Transfers": 21,
    "Baggage Delay": 3,
    "Cancel Trip": 26,
    "Cancellation Policy": 7,
    "Carry On Luggage Faq": 1,
    "Change Flight": 15,
    "Check In Luggage Faq": 11,
    "Complaints": 23,
    "Damaged Bag": 9,
    "Discounts": 19,
    "Fare Check": 16,
    "Flight Status": 4,
    "Flights Info": 20,
    "Frequent Flyer": 18,
    "Insurance": 14,
    "Meal Preferences": 6,
    "Medical Policy": 10,
    "Missing Bag": 17,
    "Pet Travel": 12,
    "Prohibited Items Faq": 2,
    "Refund / Compensation": 27,
    "Seat Availability": 8,
    "Seat Upgrade Request": 0,
    "Special Assistance": 24,
    "Sports Music Gear": 13,
    "Travel Alerts": 5,
    "Travel Documents": 25
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "problem_type": "single_label_classification",
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "torch_dtype": "float32",
  "transformers_version": "4.43.3",
  "vocab_size": 30522
}
